outline.tex
% Created 2024-03-14 Thu 09:58
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{enumerate}
\author{Andrew}
\date{\today}
\title{A Modal Propositions-As-Types Principle for Choreographic and Multitier Programming (Abstract)}
\hypersetup{
 pdfauthor={Andrew},
 pdftitle={A Modal Propositions-As-Types Principle for Choreographic and Multitier Programming (Abstract)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.6.21)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section{Intro}
\label{sec:org9bb3d42}
\subsection{Doxastic Logic}
\label{sec:org2422f84}
\subsubsection{Multiagent logic of belief}
\label{sec:org404c910}
\begin{enumerate}
\item Concurrent intuition: Different agents as threads
\label{sec:org0226ebc}
\item Natural fit for global paradigms
\label{sec:org6bacdfc}
\end{enumerate}
\subsubsection{Beliefs about Beliefs}
\label{sec:orgfdc9984}
\begin{enumerate}
\item "Alice believes that Bob believes that \ldots{}"
\label{sec:org10e2b8f}
\item Challenge: What does this mean in the concurrent interpretation
\label{sec:orgc316c3e}
\item N.B.: Alice's Bob is completely separate from Bob
\label{sec:orgf5cf8e7}
\begin{enumerate}
\item Distinguishes Doxastic from Epistemic logic
\label{sec:orgeefe951}
\end{enumerate}
\end{enumerate}
\subsection{Communication and Authorization Logic}
\label{sec:orge531c5a}
\subsubsection{Second challenge: Lack of communication primitives}
\label{sec:org1613438}
\subsubsection{Communication implicitly occurs between an agent and their process}
\label{sec:org0bd14d2}
\begin{enumerate}
\item In a PaT interpretation of "Alice believes (Bob believes Phi)", Alice has access to some resource representing Bob believing Phi
\label{sec:orgbc70f9a}
\end{enumerate}
\subsubsection{Authorization logic adds explicit communication}
\label{sec:orga27cc97}
\begin{enumerate}
\item Used to reason about security policies in distributed systems
\label{sec:org679550b}
\item Speaksfor (static) as channels
\label{sec:org23e82a9}
\item Speaksfor-elim as communication
\label{sec:org359d568}
\end{enumerate}
\subsubsection{Nested Beliefs and Hierarchical Computing}
\label{sec:orga24f921}
\begin{enumerate}
\item Nested Beliefs create a tree structure on agents
\label{sec:org2c35dfc}
\item Idea: hierarchical computing as a PaT interpretation
\label{sec:org069d876}
\begin{enumerate}
\item Examples: threads on nodes, server farms, owner-worker topologies\ldots{}
\label{sec:org2da5da2}
\end{enumerate}
\item Authorization-logic speaksfor as choreographic send
\label{sec:org9df3657}
\item Self-knowledge and Multitier programming
\label{sec:org0f03057}
\end{enumerate}
\subsubsection{This talk}
\label{sec:orgea924b7}
\begin{enumerate}
\item Calculus for PaT Hierarchical Computing
\label{sec:org95633c5}
\begin{enumerate}
\item WIP!
\label{sec:org83cf4e5}
\end{enumerate}
\item Logical Conjectures
\label{sec:org1bb92df}
\item Computational Conjectures
\label{sec:orgb48dbd2}
\end{enumerate}
\section{Doxastic Logic \& Authorization Logic}
\label{sec:org258612a}
\subsection{Believes modality}
\label{sec:orgaa88343}
\subsubsection{Represents}
\label{sec:orga867801}
\section{A Hierarchical Choreographic Calculus}
\label{sec:org05b5587}
\section{Conjectures}
\label{sec:org719ad98}
\end{document}
